; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p1-2 - location
	p1-4 - location
	p2-0 - location
	p2-5 - location
	p3-1 - location
	p3-7 - location
	p4-3 - location
	p4-5 - location
	p4-7 - location
	p5-6 - location
	p7-1 - location
	p7-2 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s1)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s0)
	(at package2 s6)
	(at package3 s2)
	(at package4 s2)
	(at package5 s6)
	(at package6 s5)
	(at package7 s6)
	(at package8 s0)
	(at package9 s1)
	(at package10 s4)
	(at package11 s5)
	(at package12 s2)
	(at package13 s2)
	(at package14 s6)
	(at package15 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 90)
	(= (time-to-drive s2 s0) 90)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 80)
	(= (time-to-drive s2 s1) 80)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 77)
	(= (time-to-drive s5 s2) 77)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 65)
	(= (time-to-drive s0 s3) 65)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 47)
	(= (time-to-drive s5 s3) 47)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 6)
	(= (time-to-drive s0 s4) 6)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 3)
	(= (time-to-drive s1 s4) 3)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 3)
	(= (time-to-drive s2 s4) 3)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 46)
	(= (time-to-drive s3 s4) 46)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 16)
	(= (time-to-drive s0 s5) 16)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 66)
	(= (time-to-drive s6 s5) 66)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 93)
	(= (time-to-drive s7 s5) 93)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 40)
	(= (time-to-drive s0 s6) 40)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 89)
	(= (time-to-drive s1 s6) 89)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 97)
	(= (time-to-drive s2 s6) 97)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 80)
	(= (time-to-drive s4 s6) 80)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 19)
	(= (time-to-drive s2 s7) 19)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s6)
	(at driver3 s7)
	(at truck2 s6)
	(at package1 s4)
	(at package2 s0)
	(at package3 s3)
	(at package4 s5)
	(at package5 s2)
	(at package6 s7)
	(at package7 s0)
	(at package8 s4)
	(at package9 s0)
	(at package10 s3)
	(at package11 s3)
	(at package12 s2)
	(at package13 s4)
	(at package14 s6)
	(at package15 s5)
	))

(:metric minimize (+ (* 2 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (load-truck package10 truck1 s4)
   deleted: (at package10 s4)
   added: (in package10 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 18
2. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 18
3. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 0 to 66
   goals met: 3 of 18
4. (walk driver3 s1 p3-1)
   deleted: (at driver3 s1)
   added: (at driver3 p3-1)
   goals met: 3 of 18
5. (walk driver3 p3-1 s3)
   deleted: (at driver3 p3-1)
   added: (at driver3 s3)
   goals met: 3 of 18
6. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 18
7. (load-truck package8 truck1 s0)
   deleted: (at package8 s0)
   added: (in package8 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 3 of 18
8. (drive-truck truck1 s0 s4 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 66 to 162
   goals met: 3 of 18
9. (unload-truck package1 truck1 s4)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 4 of 18
10. (unload-truck package8 truck1 s4)
   deleted: (in package8 truck1)
   added: (at package8 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 5 of 18
11. (drive-truck truck1 s4 s6 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (fuel-used) from 162 to 1042
   goals met: 5 of 18
12. (board-truck driver3 truck2 s3)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 5 of 18
13. (load-truck package2 truck1 s6)
   deleted: (at package2 s6)
   added: (in package2 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 5 of 18
14. (load-truck package5 truck1 s6)
   deleted: (at package5 s6)
   added: (in package5 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 5 of 18
15. (drive-truck truck2 s3 s5 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (fuel-used) from 1042 to 1512
   goals met: 5 of 18
16. (load-truck package11 truck2 s5)
   deleted: (at package11 s5)
   added: (in package11 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 18
17. (load-truck package6 truck2 s5)
   deleted: (at package6 s5)
   added: (in package6 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 5 of 18
18. (load-truck package7 truck1 s6)
   deleted: (at package7 s6)
   added: (in package7 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 5 of 18
19. (drive-truck truck2 s5 s7 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   changed: (fuel-used) from 1512 to 2721
   goals met: 5 of 18
20. (unload-truck package6 truck2 s7)
   deleted: (in package6 truck2)
   added: (at package6 s7)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 6 of 18
21. (drive-truck truck1 s6 s1 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (fuel-used) from 2721 to 4501
   goals met: 6 of 18
22. (load-truck package9 truck1 s1)
   deleted: (at package9 s1)
   added: (in package9 truck1)
   changed: (load truck1) from 4 to 5, (fuel-per-minute truck1) from 20 to 25
   goals met: 6 of 18
23. (drive-truck truck1 s1 s4 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 4501 to 4576
   goals met: 6 of 18
24. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 4576 to 4726
   goals met: 6 of 18
25. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   changed: (load truck1) from 5 to 4, (fuel-per-minute truck1) from 25 to 20
   goals met: 7 of 18
26. (unload-truck package7 truck1 s0)
   deleted: (in package7 truck1)
   added: (at package7 s0)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 8 of 18
27. (unload-truck package9 truck1 s0)
   deleted: (in package9 truck1)
   added: (at package9 s0)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 9 of 18
28. (drive-truck truck1 s0 s4 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 4726 to 4804
   goals met: 9 of 18
29. (drive-truck truck2 s7 s5 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   changed: (fuel-used) from 4804 to 5827
   goals met: 9 of 18
30. (drive-truck truck1 s4 s6 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (fuel-used) from 5827 to 6867
   goals met: 9 of 18
31. (drive-truck truck2 s5 s3 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   changed: (fuel-used) from 6867 to 7384
   goals met: 9 of 18
32. (unload-truck package11 truck2 s3)
   deleted: (in package11 truck2)
   added: (at package11 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 10 of 18
33. (drive-truck truck2 s3 s5 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (fuel-used) from 7384 to 7854
   goals met: 10 of 18
34. (drive-truck truck1 s6 s4 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (fuel-used) from 7854 to 8894
   goals met: 10 of 18
35. (drive-truck truck2 s5 s7 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   changed: (fuel-used) from 8894 to 9824
   goals met: 10 of 18
36. (drive-truck truck1 s4 s2 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 9824 to 9863
   goals met: 10 of 18
37. (unload-truck package5 truck1 s2)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 11 of 18
38. (load-truck package13 truck1 s2)
   deleted: (at package13 s2)
   added: (in package13 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 11 of 18
39. (load-truck package3 truck1 s2)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 11 of 18
40. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 11 of 18
41. (drive-truck truck1 s2 s4 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 9863 to 9923
   goals met: 11 of 18
42. (unload-truck package13 truck1 s4)
   deleted: (in package13 truck1)
   added: (at package13 s4)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 12 of 18
43. (drive-truck truck1 s4 s6 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (fuel-used) from 9923 to 11203
   goals met: 12 of 18
44. (drive-truck truck1 s6 s5 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (fuel-used) from 11203 to 12259
   goals met: 12 of 18
45. (unload-truck package4 truck1 s5)
   deleted: (in package4 truck1)
   added: (at package4 s5)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 13 of 18
46. (drive-truck truck2 s7 s2 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s2)
   changed: (fuel-used) from 12259 to 12449
   goals met: 13 of 18
47. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 12449 to 13060
   goals met: 13 of 18
48. (unload-truck package3 truck1 s3)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 14 of 18
49. (unload-truck package10 truck1 s3)
   deleted: (in package10 truck1)
   added: (at package10 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 15 of 18
50. (drive-truck truck1 s3 s0 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 13060 to 13710
   goals met: 15 of 18
51. (drive-truck truck1 s0 s6 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (fuel-used) from 13710 to 14110
   goals met: 15 of 18
52. (drive-truck truck2 s2 s6 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   changed: (fuel-used) from 14110 to 15080
   goals met: 16 of 18
53. (drive-truck truck1 s6 s5 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (fuel-used) from 15080 to 15740
   goals met: 16 of 18
54. (drive-truck truck1 s5 s7 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   changed: (fuel-used) from 15740 to 16670
   goals met: 16 of 18
55. (drive-truck truck1 s7 s2 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   changed: (fuel-used) from 16670 to 16860
   goals met: 16 of 18
56. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 16 of 18
57. (drive-truck truck2 s6 s5 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   changed: (fuel-used) from 16860 to 17520
   goals met: 15 of 18
58. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 15 of 18
59. (drive-truck truck3 s2 s6 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 17520 to 18490
   goals met: 15 of 18
60. (drive-truck truck2 s5 s6 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (fuel-used) from 18490 to 19150
   goals met: 16 of 18
61. (disembark-truck driver3 truck2 s6)
   deleted: (driving driver3 truck2)
   added: (at driver3 s6) (empty truck2)
   goals met: 16 of 18
62. (disembark-truck driver1 truck3 s6)
   deleted: (driving driver1 truck3)
   added: (at driver1 s6) (empty truck3)
   goals met: 17 of 18
63. (board-truck driver1 truck2 s6)
   deleted: (at driver1 s6) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 16 of 18
64. (drive-truck truck2 s6 s5 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   changed: (fuel-used) from 19150 to 19810
   goals met: 15 of 18
65. (drive-truck truck2 s5 s7 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   changed: (fuel-used) from 19810 to 20740
   goals met: 15 of 18
66. (board-truck driver3 truck3 s6)
   deleted: (at driver3 s6) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 15 of 18
67. (drive-truck truck2 s7 s5 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   changed: (fuel-used) from 20740 to 21670
   goals met: 15 of 18
68. (drive-truck truck2 s5 s6 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (fuel-used) from 21670 to 22330
   goals met: 16 of 18
69. (disembark-truck driver1 truck2 s6)
   deleted: (driving driver1 truck2)
   added: (at driver1 s6) (empty truck2)
   goals met: 17 of 18
70. (drive-truck truck3 s6 s5 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 22330 to 22990
   goals met: 17 of 18
71. (drive-truck truck3 s5 s7 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   changed: (fuel-used) from 22990 to 23920
   goals met: 17 of 18
72. (disembark-truck driver3 truck3 s7)
   deleted: (driving driver3 truck3)
   added: (at driver3 s7) (empty truck3)
   goals met: 18 of 18
